#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=b2fa440073730eedd2c21a1c89229c2ffeef2698]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NDgzOTJiMS0yYmFhLTRiMzAtYjg5Ny1hOGJkNjNiYWE2NmU7b2JqZWN0SWQ9ZjQ3ODVhNTgtOWQ5Yy00NWFkLTliYTctNzgwYWIwYTkyYzRjO3N1YnNjcmlwdGlvbklkPWE5NGYwNzU4LTk0YTgtNDI2ZC1hM2I2LWFlYzZlODNiNTFkZTt0ZW5hbnRJZD02NzVjYjM1Ny0yMWI4LTQxOGUtYjc4MC05YmEwNGQyMjNiZGE=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                                          = "example-machine" -> (known after apply)
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/a94f0758-94a8-426d-a3b6-aec6e83b51de/resourceGroups/ambati-20241118-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                                                   = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address                                     = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
      - tags                                                   = {} -> null
      ~ virtual_machine_id                                     = "53d828f7-3639-4f78-a52b-a99082518552" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (29 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ name                             = "example-machine_OsDisk_1_511603d029a04be0ad66a36cd7a641e9" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @praveenambati1233, Action: `pull_request`*